app/controllers/markets_controller.rb

  def index
    @markets = Market.all
---
SELECT "markets".* FROM "markets"

  def create
    @params = params
    @market = Market.new
    @market.name = params[:market][:name]
    @market.address = params[:market][:address]
    @market.city = params[:market][:city]
    @market.state = params[:market][:state]
    @market.zip = params[:market][:zip]
    @market.county = params[:market][:county]

    if(@market.save)
---
INSERT INTO "markets" ("name", "address", "city", "state", "zip", "county", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)