app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def create
    @params = params
    @vendor = Vendor.new
    @vendor.name = params[:vendor][:name]
    @vendor.employees = params[:vendor][:employees]
    @vendor.market_id = params[:vendor][:market_id]

    if(@vendor.save)
---
INSERT INTO "vendors" ("name", "employees", "market_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rachel's Clocks"], ["employees", 1], ["market_id", 0], ["created_at", "2016-10-05 16:53:24.484498"], ["updated_at", "2016-10-05 16:53:24.484498"]]